XYZ Heading1
============

<!--Provide the name of the grouping of commands, for example, LLDP commands-->

[TOC]

XYZ Configuration Commands
--------------------------
### First Command ###

#### Syntax ####
<!-- For example,    command [optional parameter] <user-input> [choose|one] -->

#### Description ####
<!-- Provide a description of the command. -->

#### Authority ####
<!-- Provide who is authorized to use this command, such as Super Admin or all users. -->

#### Parameters ####
<!-- Provide for the parameters for the command. -->

| Parameter | Status   | Syntax         | Description                           |
|:-----------|:----------|:----------------:|:---------------------------------------|
| *arg1* | Required | ... | arg1 descr |
| *arg2* | Required | ... | arg2 descr |

#### Examples ####
<!--    myprogramstart -s process_xyz-->

```
switch(config)#feature enable arg1 arg2
```

### Second Command ###
<!--Change the value of the anchor tag above, so this command can be directly linked. -->

### First Command ###

#### Syntax ####
<!-- For example,    command [optional parameter] <user-input> [choose|one] -->

#### Description ####
<!-- Provide a description of the command. -->

#### Authority ####
<!-- Provide who is authorized to use this command, such as Super Admin or all users. -->

#### Parameters ####
<!-- Provide for the parameters for the command. -->

| Parameter | Status   | Syntax         | Description                           |
|:-----------|:----------|:----------------:|:---------------------------------------|
| *arg1* | Required | ... | arg1 descr |
| *arg2* | Required | ... | arg2 descr |

#### Examples ####
<!--    myprogramstart -s process_xyz-->

```
switch(config)#feature enable arg1 arg2
```

Display Commands
----------------

### First command ###
<!--Change the value of the anchor tag above, so this command can be directly linked. -->

#### Syntax ####
<!--For example,    myprogramstart [option] <process_name> -->

#### Description ####
<!--Provide a description of the command. -->

#### Authority ####
<!--Provide who is authorized to use this command, such as Super Admin or all users.-->

#### Parameters ####
<!--Provide for the parameters for the command.-->

| Parameter | Status   | Syntax         | Description                           |
|:-----------|:----------|:----------------:|:---------------------------------------|
| *arg1* | Required | ... | arg1 descr |
| *arg2* | Required | ... | arg2 descr |

#### Examples ####
<!--    myprogramstart -s process_xyz-->

```
switch(config)#feature enable arg1 arg2
```

### Second command ###
<!--Change the value of the anchor tag above, so this command can be directly linked. -->

#### Syntax ####
<!--For example,    myprogramstart [option] <process_name> -->

#### Description ####
<!--Provide a description of the command. -->

#### Authority ####
<!--Provide who is authorized to use this command, such as Super Admin or all users.-->

#### Parameters ####
<!--Provide for the parameters for the command.-->

| Parameter | Status   | Syntax         | Description                           |
|:-----------|:----------|:----------------:|:---------------------------------------|
| *arg1* | Required | ... | arg1 descr |
| *arg2* | Required | ... | arg2 descr |

#### Examples ####
<!--    myprogramstart -s process_xyz-->

```
switch(config)#feature enable arg1 arg2
```
